fullstack250px/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Tx6AmVYEwidb4m71IJO1IA"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= User.find_by(session_token: self.session[:session_token])